app/Models/AdminInputModel.php

    public function edit_data($data){
        return $this
        ->set([
            'username' => $data['Username'],
            'email' => $data['Email'],
            'password' => $data['Password'],

        ])
        ->where("nrp", $data['Nrp'])
        ->update();
---
UPDATE `user` SET `username` = 'daniel', `email` = 'daniel@gmail.com', `password` = '1234'
WHERE `nrp` = 'c14220211'